[
  {
    "title": "\"Your Highness\" Class Monitor",
    "link": "http://www.chinesedrama.info/2019/05/drama-your-highness-class-monitor.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhiMAtIPuk9vOh6i6sqinA3LD6F-9SDSjFaQEhjqPPI0rgb2Fft1o7tYuHuhwrX58qU8CJYhfvUDLz1SbZaVrWFVpjYcOgmWexwCmLKiynffMti8Wc4yMaRbQxZ9VZYQaPGc-5jMYcTHCn7/w180-c-h250/?Your Highness Class Monitor China Web Drama.jpg",
    "summary": "It follows Gu Zichen, the rebellious son of a wealthy family, and Su Nianian, the competitive student who has to adjust to a school that she never wanted. Because of an accidental meeting, the two start a relationship of constant bickering and eventually fall in love.Su Niannian (Xing Fei) has set her sights on the top-tier schools like Beijing University and Tsinghua University. A traffic accident causes her to be late and it ultimately results in her failing to gain admission. She gets into an engineering university in a small city and in this ordinary school full of problem students, Su Niannian has to assure herself that her stay is temporary.However, she runs into Gu Zichen (Niu Junfeng), the culprit behind her current conundrum. Su Niannian's fighting spirit shines and inspires each of her classmates who may act tough and act like they don't care to hide their insecurities. As she gradually changes her prejudice, the class learns to work together towards a common goal."
  },
  {
    "title": "#MeToo",
    "link": "http://www.chinesedrama.info/2021/11/web-drama-metoo.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiaYAl9Vut2IDb4WxSYIm3tg9yoVlOZnU6GCIqM-GjrKU_onL1ma0o4nM05InGucnecvx-JJXGzk06ijAEX2D14oBqwQKiSdcNt1d59Ej5VP8Yk8Am1os4Ts-vJweSA8MwHV9bJQ6gBtVFF/w180-c-h250 Hong Kong Web Drama.jpg",
    "summary": "A story that revolves around sexual harassment in the workplace follows Lin Zihui who accuses her boss He Yingjie, a married man with a complicated life, of sexual harassment.Fresh graduate Lin Zihui (Venus Wong) was personally hired as a designer by the boss of their advertising firm. She becomes the talk of the town because everyone assumes that she got in for her looks. Lin Zihui is repeatedly hit on my male colleagues and clients. Luckily, her superior He Yingjie (Edmund Leung) steps in to help and they quickly become close.He Yingjie is facing a crisis not just due to his marital woes but also due to work. He also has to deal with his boss Deng Yiwen's (Angie Cheong) constant flirtations. Meanwhile, the competition between company executives has become cut throat. While working on an project, Lin Zihui becomes a victim of sexual assault. She identifies He Yingjie as the man who harassed her yet he vehemently denies her accusation."
  },
  {
    "title": "100% Wife",
    "link": "http://www.chinesedrama.info/2018/05/drama-100-wife.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhVsjwyR_Hc_ScZemYwV6NkNyaJxIuvkOgRf048zlJDW91XfojdBlsM6SnIYt8uTx51M0400hQp2R4_o1Insh8o5Jvx30vyqrlPh2i_lZrnFQtrhyphenhyphenKne0Y7mSQoEYNko048TnqZkxMRfTQ/w180-c-h250/270x360.jpg",
    "summary": "The Jin Family's story is the story of every person, man or woman, young or old, we encounter happiness and sadness in our everyday lives.As times change, so do people's outlook in life, but one thing that is constant are the relationships between people. Each family has their on cross to bear. Under the roof of the Jin Family are many generations living together, each with their own mindset. It's about mother-in-laws and their daughter-in-laws. Mothers who hope that their sons can end up with the best match for them. To the new generation of women, it's a question whether to marry or not to marry."
  },
  {
    "title": "11LEFT",
    "link": "http://www.chinesedrama.info/2021/09/drama-11left.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjweEXiWl4r8QTXE-4g-DRutjz6S4C21FQPm-OYRRB7EXOAL1MX6renxyQyDgWiX1PZlpJRT4qOm1gurmjaGPzO7gbQl3L_VkzZ6pNK07AkUwkWRgTNfd7wrprGoymkhQyFJLhQdcE_Fj5P/w180-c-h250?11LEFT China Drama.jpg",
    "summary": "The original September 2020 release was postponed due to production issues.It is a miniseries starring Li Xian with episodes around 5 minutes long."
  },
  {
    "title": "1931 Love",
    "link": "http://www.chinesedrama.info/2016/12/drama-1931-love.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiqG70784CPkwsYCqk37AdZBRy9zXMCva3HyEVGV70CtCw6cwzPNJY8jDl4ESDudKYtAIwnTSshS0laTZgbvikqA34GS3LYci2Ne1YU3UJl8RzPCNflMhYijc09BWHML5JMsSP7xVdgI_fd/w180-c-h250/1340.jpg",
    "summary": "Amidst the winds of change during the Republican era is a story about four young men and women.Shen Muzhi is a big shot tycoon in the business community who dies a mysterious death. He leaves a sizeable sum that has become a legendary story in the social circles of the Shanghai Bund. Many factions hope to covet the treasures for themselves.Shen Shuhao (Fu Xinbo) is the young master of the Shen Family who returns home after three years. He helps Shang Wanting (Han Chae Young), his wife in name, out of trouble and gets in the way of Shen Yue's (Zhang Liang) plans to take the family inheritance for himself. However, Shen Shuhao is merely an imposter with another identity while Shang Wanting married into the Shen Family for money. Will they make the right choice when the nation is in a time of need?"
  },
  {
    "title": "19th Floor",
    "link": "http://www.chinesedrama.info/2024/01/19th-floor.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3t1rayNddaobxWPA0twuHGhrk-wW_B-iPeSP-CKZXarTy2i6uxddiYq32putWD4deFlf9WBPVfppUZdTFSw_zHulA1DVSr9lPHA4KMHQ58ETfHwKLGVp8XtrKSltSUzYm-p-vpstg0gxx/w180-c-h250/19361.jpg",
    "summary": "College student Chunyu and others find themselves ensnared in the enigmatic \"19th Floor\" game, unable to break free from its virtual clutches. Chunyu, estranged from her father since childhood, forms an unlikely alliance with the intelligent Gao Xuan, fighter Doudou, and humorous Yang Bawan as they navigate through the game's treacherous levels. From a shadow puppet-filled \"ghost building\" to a deserted village haunted by figurines, each stage claims the consciousness of Chunyu's friends, plunging them into comas in the real world."
  },
  {
    "title": "24 Hours",
    "link": "http://www.chinesedrama.info/2018/07/web-drama-24-hours.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgAgF9XPrheAyls0ZBoMpdhtJkX7rwO7VLaUKJ7vZJhcn4O3Re_eUrfB6fVIQLC4b5j_g78crjoxaAt5yZdU32Tkjw5iSGovzIvNhP5jANRqjd718Km1z-ImAb-94H59ZtnE-853jIJgrgc/w180-c-h250/24+Hours++9185.jpg",
    "summary": "Li Xin and An Ding are frenemies with peculiar personalities. Due to an incident, they unleash a miraculous ability to turn inanimate objects into people, but only for the duration of 24 hours. As the things in An Ding's house become human, it starts them on a bizarre yet dangerous adventure."
  },
  {
    "title": "24 Turns",
    "link": "http://www.chinesedrama.info/2015/09/drama-24-turns.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgmR1wiKC8smdBts80LK4vU62CMQskPBYMoCWwOys3FZll2eJWg8D6R9mesv3hBp7kTbRzJVNKHf1W_tXHgAbO1qg712Ki1yLKKJIsNpJOyT2x1ttflJYaW7BzRtZZSrHJ4F9UROIcCNBk/w180-c-h250/3050.jpg",
    "summary": null
  },
  {
    "title": "49 Days with a Merman",
    "link": "http://www.chinesedrama.info/2022/02/drama-49-days-with-merman.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjYepwyCvWVNVJENxNZfG9kh07RGHDLBbDbtBjb8owKqVkpMSOO1LeUIeZU880fSVJ-Uujglx-zB3spum2EOWVrWE6CeOyGt6pHvAKyWTUcFg05arcjQTTiK2VTIvW1-WVMyqsPUnghb13y/w180-c-h250?49 Days with a Merman Taiwan Drama.jpg",
    "summary": "The cowardly high school student Zhao Longjie (Kent Tsai) just wants to catch a break from all the bad luck in his life. One day, he inexplicably encounters a domineering \"merman.\" In order to find a way to send Ren Yu (Bruce Hung) back to the sea, they begin a bizarre experience of living together.Ren Yu (Bruce Hung) who is a merman from the legends has not only become a tenant residing in the bathroom of high school student Longjie (Kent Tsai) but also becomes his classmate! He loves to eat, sleep, make trouble and uses brute force all day long to persuade Longjie to help him figure out the reason why he was summoned ashore. It turns out that their fates have long been destined. Even if Longjie is unwilling, Ren Yu is the test that he cannot escape and the friend he is reluctant to let go."
  },
  {
    "title": "8848",
    "link": "http://www.chinesedrama.info/2015/11/drama-8848.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh8FkPKG6MwhbHLfEJkhVKTJUyioGvuQ6wq7BTg3MJhohLyJaPfEuQw0o7P25izV42eV7uGYiVxKrmXiYFfN3yiWsVpzBeoTmAH2EnO4mdSYa4cm0ThQnlTz57oEvkS7gb1tRyg-iL-0UU/w180-c-h250/2417.jpg",
    "summary": null
  },
  {
    "title": "90s Beijing Fantasy",
    "link": "http://www.chinesedrama.info/2018/12/drama-90s-beijing-fantasy.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhZXmI7-a8dSXe7mryDjPWQiiz2ZnhM6TWKNTXMxL_bPLn0OHUJ94P-NGmgTHb_B6qWRmGlHj2fDExqBY6roiG1hcNl3ifKb_Zx11kctGujF7j9Km_GAAPAJ4HB816S943pjuM8M1uSG_8/w180-c-h250/90s+Beijing+Fantasy++270x360.jpg",
    "summary": "A nostalgic coming-of-age tale that follows young men and women from the same high school in the early 1990's.The main story develops in the past with a supporting storyline from the present. The stage is set in Xisi High School, a place for underachievers and poor students, and begins from the entrance exams. Six teenagers go from strangers to friends as they live through an extraordinary experience during their youth and hold hands into the future."
  },
  {
    "title": "A Ba Yi Jia Ren",
    "link": "http://www.chinesedrama.info/2021/03/drama-ba-yi-jia-ren.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhMwrCRwa27E7Cn7s6oCCTpysknKb38uf_-Kit751dUXUm-YHp5q5A3iiGWMrcPUxrBHG4Gu3qJg1Tf5Vc_i1PYrv_62vaB35JXGr8jCQnRVz6twA9R5KrkSS4XsPwQMgtPTr-lZUtapgFC/w180-c-h250/?A Ba Yi Jia Ren China Drama.jpg",
    "summary": "It tells the sorrows and joys of a large Han-Tibetan family in Aba Prefecture, Sichuan Province and follows the journey of Yang Yaozhou who was born in the 1980s. The people in this pure and  beautiful land are brave in the face of hardships, they love their homeland and live their lives in pursuit of happiness.Yang Yaozhou (Purba Rgyal) was born into a Han-Tibetan family in Aba. Unfortunately, his grandfather died on the job. His father, brother and sister remained in Aba for work. After graduating from Nanjing University, Yang Yaozhou had intended to go overseas for further studies with his girlfriend Xia Rou (Miao Tingru) but his father is forcing him to return to Aba. In order to avoid going home, Yang Yaozhou willingly works on tourism development projects in the remote location of Qiangzhai thinking that he can return to Nanjing for graduate school after two years to be with his girlfriend. However, his brother dies unexpectedly while his father falls ill. Yang Yaozhou breaks up with Xia Rou and makes the decision to stay in Aba. Yang Yaozhou participates in the design of the Jiuzhaigou-Huanglong tourism circle to turn it into a golden tourist route, yet a devastating earthquake wipes out everything. Yang Yaozhou manages to start over through his mother's encouragement. With aid going to all parts of China, the tourism industry of Aba booms again."
  },
  {
    "title": "A Beautiful Girl at War",
    "link": "http://www.chinesedrama.info/2019/01/drama-beautiful-girl-at-war.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgtYW-WqyxBdH8tueE28eUpLmiXsc4seno7ChTJO1csg_Paow8YvWvoQbQ0Pp_K0frqHP-d28dWDOSxPJ62SeqNl67QC888r_yBGX5U-vm9F0FwUJqMPk-nJh9mmgPHiU19e_ROS3U4-XY/w180-c-h250/A+Beautiful+Girl+at+War++270x360.jpg",
    "summary": "A princess from the late Qing Dynasty experiences the demise of her clan. She thrives in a rough environment and gradually matures into a strong businesswoman.Despite being a fallen royalty, Tong Yuwan (Shu Chang) is part of a new generation of women during the Republican era. She falls in love with Zhou Tingchen (Qiao Zhenyu) after he rescues her from peril, but her parents force her to marry Du Yuntang (Sammul Chan), the son of a wealthy tycoon. Du Yuntang appears frivolous as a front, but he is strategic and the best business partner that Yuwan can have.Meanwhile, Zhou Tingchen joins the revolutionary movement. His friend Li Shaofeng (Kelvin Lee) pretends to be the Li family's only son. He offers up his younger sister Li Xuemei (Li Jingyang) to warlord Shen Zhipei (Tan Kai). He also works for a Japanese firm and becomes a fierce competitor for the Du family as they contend for development projects. As a woman, Yuwan experiences complicated entanglements with the people in her life from her lover Zhou Tingchen, husband Du Yuntang, friend Li Xuemei, enemy Li Shaofeng to twins Qing Ping (Wu Jinyan) and Hong Yu (Wu Jinyan)."
  },
  {
    "title": "A Camellia Romance",
    "link": "http://www.chinesedrama.info/2021/01/web-drama-xu-chun-chun-de-cha-hua-yun.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhA4RIQfXEVwcoI5_jRzXszC13MAhEs0MGg53sawNwEOQfWDQSK4NY4ROJ-EdDpl82k2KTmrLF39FO3XjvVXa4tMMYhA0u7jUZ6MLCDDBdLeHg0oRpvyHOwHvbJiaWtcsw-BgtbGDyJ1oNv/w180-c-h250/?A Camellia Romance China Web Drama.jpg",
    "summary": "Xu Chunchun marries into the Zhou family as a way to escape her old life and realize her dream of starting her own business. To her surprise, her husband has fallen in love with her at first sight!Through a strange combination of circumstances, Xu Chunchun (Li Mozhi) catches the eye of the Zhou family which has a reputation for being the world's number one tea merchant. They intend to have her marry their precious son Zhou Junjue (Guo Zifan) who is the legitimate heir of the family.Xu Chunchun may be the only daughter in their silk manor but she is continually oppressed by her stepmother. As a way out of her situation, Xu Chunchun grits her teeth and accepts the wedding proposal. She wants nothing more than to be divorced but finds herself in a bind because Zhou Junjue has fallen in love with her."
  },
  {
    "title": "A Chinese Odyssey: Love of Eternity",
    "link": "http://www.chinesedrama.info/2015/12/drama-chinese-odyssey-love-you-million.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhdiEMYhiVXdKoPK2kge44D3iHCtz4c42XBuyOpescftLrn9xSl4aoQhunbifrl8_j99hj_5SLKlSaD_5TZ4K_uToOAxsMaS28XHlOAAdyWXHkZ97V3I1tnhma3vOkiwe1rqAhDxm0RLLQ/w180-c-h250/A+Chinese+Odyssey+Love+Eternity+Poster+1.jpg",
    "summary": "A story that follows Joker aka Zhu Zun Bao as he experiences the bliss and heartaches of a passionate romance.Five hundred years ago, Zi Xia descends to the human realm to find Zhi Zun Bao. He is the man that she loves and the person who pulled out the Zi Qing Sword. However, the sword gets damaged along the way and she uses the time traveling ability of the pandora's box in hopes of repairing it. She ends up five hundred years later and meets Zhi Zun Bao with no recollection of his past life. He is the leader of a gang of outlaws called the ax gang and has been spending time with Bai Jing Jing. The plot then takes on a whole new level of craziness that involves more time traveling and outrageous happenings. (Source:DramaPanda)."
  },
  {
    "title": "A Clear Midsummer Night",
    "link": "http://www.chinesedrama.info/2019/01/drama-clear-midsummer-night.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgdk0DBNMsI_u4MfvlKqYiqMfwvDooCwcXDss1jj-G24jVRdq8TTok4FWK6SwW31E5dL4Z5XFMazELx0XIZgSB7Lm3mJIhmHNY5_njE_NG2amrQ500COP1IBiX_mG96MZbKYPrTUpm7ueM/w180-c-h250/A+Clear+Midsummer+Night++322.jpg",
    "summary": "A story that follows a young woman from a rich family. After being manipulated by her own friend and dumped by her own fiancee, she is saved by a playboy socialite, but it causes her to fall into an even bigger trap.Xia Wanqing (Yang Mi) is the daughter of the chairman of Hua Lang Group, the country's leading real estate investments company. Xia Wanqing gets caught in a predicament after her friend Lai Xue (Liang Youlin) puts one over her and her fiancee Mo Lingtian (Wu Jianfei) breaks their engagement. Although Qiao Jinfan (Hawick Lau) from the Qiao Group gets her out of trouble, it is merely the beginning of a grand conspiracy.Xia Wanqing's real identity floats to the surface while Qiao Jinfan's notorious image as a womanizer is simply a mask that he wears. Having their own agenda, Xia Wanqing and Qiao Jinfan start dating each other. Amidst the dispute between two powerful families, fake friends, evil foes and business conspiracies, the two people who have stopped believing in love gradually find a reason to believe in it again."
  },
  {
    "title": "A Date with the Future",
    "link": "http://www.chinesedrama.info/2021/12/web-drama-date-with-future.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiVN2SKWClRSOcw1Nu1r9zyQMtnO2pRXGgD15zQwmjLUWQnDrDvyJvPldXByUuaB2QjDN3SIORR3VaSEi9f2DblUjbMebisy9EbOPnvsct5tH3P7Mbv3Zc4xM7MYkqp0NGUhw1xZkYkMKD9/w180-c-h250?A Date with the Future China Drama.jpg",
    "summary": "From a rescue operation ten years ago to their encounter ten years later, firefighter Jin Shichuan and Xu Lai who's now a journalist and a dog trainer become partners.Ten years ago, Xu Lai (Zhang Ruonan) was trapped duing an earthquake until she was rescued by firefighter Jin Shichuan (William Chan) and his rescue dog Zhuifeng. In order to comfort an injured Xu Lai, Jin Shichuan agrees to a ten-year promise.Ten years later, Xu Lai returns to China as a journalist and a dog trainer. She meets Jin Shichuan at a rescue site. He not only fails to recognize her but also mistakes her for an unscrupulous reporter. Xu Lai disregards their misunderstanding and does right by her report.When the search and rescue dog team is formed, Xu Lai becomes Jin Shichuan’s partner due to her international qualifications as a dog trainer. She wins over everyone with her tried and tested skills and even gives her rescue dog Ping'an to Jin Shichuan to help him walk out of the shadow. As reporters and firefighters, the two people always meet on the frontlines. In every emergency and repeated life and death encounters, they gradually fall in love."
  },
  {
    "title": "A Different Kind of Pretty Man",
    "link": "http://www.chinesedrama.info/2016/07/drama-different-kind-of-pretty-man.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEge2rnkhktdlOeBZ-7YxrHtUK8WazGSRqXCH69UrzbgYJ6BzayRWOht5bsJXHbXYpSOaGNp1AQWBVxvFzalvGZ9dNW2fFoQR_vXEKeJdDFqQxb-jJB8Bb7YGdxRFAlMVJiqZiXyRsa7n9M/w180-c-h250/1265.jpg",
    "summary": "Gao Yuan Shu (Zhang Han) has developed superpowers after a boating accident that occurred just as he was proposing to his girlfriend of seven years (Emma Wu Ying Jie). The rest of his friends who were also in attendance seem to be experiencing the same changes."
  },
  {
    "title": "A Different Kind of Pretty Man 2",
    "link": "http://www.chinesedrama.info/2017/03/drama-different-kind-of-pretty-man-2.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiHAxP7SDRfzgssiF4s-MB77aJEzSkQM4bQP3gpQbAOKXQKH-Pk8AsikjcR1qoodAjcm2J78P5DRlEDukWMHsaQ-uEanVbAjuNp0AOmFyG9W573x0OQb8Nai8UYyme6S01LS1XJ6s6shJWd/w180-c-h250/5652.jpg",
    "summary": null
  },
  {
    "title": "A Different Mr. Xiao",
    "link": "http://www.chinesedrama.info/2023/08/a-different-mr-xiao.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgn8Jy6dnAdTHR5Wfzi2lPJdEDTJIeyOmnSNwsqymcQ6yhH3vkFksC5LulOWaOIEDfJMBrjTpbTJAjViWR8WHfClgyZPOdgYuWjCxHzlloCfsC0HkaptGpWsPwtA0Mh1vtEmKWELRDwHcrn/w180-c-h250/20116.jpg",
    "summary": "A doctor of Chinese medicine who comes from the future and a quirky cartoonist who was born in a family of doctors of traditional Chinese medicine are fated to meet due to a mission to \"find the medicine.\"Song Yiju (Duan Xingyu) is a senior student in the School of Chinese Medicine. She has been freeloading for a while as a teaching assistant to Xiao Jing (Zhao Yiqin). They've known each other for many years and have always had a mutually beneficial relationship. However, Xiao Jing completely changes after a meteor strikes. As it turns out, the Xiao Jing in front of her is from the future and his goal is to approach Yiju's grandpa to steal a precious herb"
  },
  {
    "title": "A Dream of Splendor",
    "link": "http://www.chinesedrama.info/2021/02/drama-meng-hua-lu.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjF8jd-z4g2HkQ0diABYlp2FgLIjpKGGxIFpRzQ0mEe6LC6FlOWI8GUZUQJ_e1qmppaeC36DlaJ6jCjJGRINZJO9mkLrp4Fi-dzV401bG3q2MbaWpXMibzj0tKrwOKPNSngki2i1sf3ZHap/w180-c-h250/?A Dream of Splendor China Web Drama.jpg",
    "summary": "Zhao Pan'er who has opened a tea house in Hangzhou receives the good news that her fiancee Ouyang Xu has passed the civil exams with flying colors. However, she realizes later on that he has left her. Amidst the many trials and tribulations in her life, the beautiful and intelligent Zhao Pan'er opens doors for women from a low social status to achieve equality in ancient times.Unwilling to bow down to fate, Zhao Pan'er (Liu Yifei) has decided to go to the capital to demand an explanation from her fiancee. On the way, she rushes to the aid of her good friend Song Yinzhang who was scammed into marriage and has become the victim of abuse. At the same time, she also rescues Sun Sanniang whose failed marriage leads to her suicide attempt.When Ouyang Xu learns that Zhao Pan'er has come to find him, he actually tries to drive her out. Zhao Pan'er, Song Yinzhang, and Sun Sanniang decide to stay in Bianjing, relying on their own ability to carve out their path to success. After experiencing all kinds of hardships, the three sisters work together to turn a small tea house into the largest establishment in Bianjing. Zhao Pan'er gradually learns to let herself live and to let go of her hatred towards Ouyang Xu."
  },
  {
    "title": "A Fallen Xian",
    "link": "http://www.chinesedrama.info/2024/02/a-fallen-xian.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3eI6PftZBeMMliYu3B-nwxaAvWjMaBtJcTU5DvGQNsJtRyU_WFdzlZlcgr5ANRRVJ4ToABXRT2x5Kdhsz9LzT8DISsdj9rfy_jj5ShOpAjiU4baP3qEaqFiIYgsr8b753ErkvnejhForK/w180-c-h250/21214.png",
    "summary": "During the Republic of China, con artist Chen Mu Kun, posing as a Taoist priest, flees to Wuzufang Town where he impersonates the immortal Lu Dong Bin. Lu Zu descends to punish him, but circumstances lead him to lose his powers so he has no choice but to stay in the mortal world. The two join hands to solve various mysteries in the village."
  },
  {
    "title": "A Familiar Stranger",
    "link": "http://www.chinesedrama.info/2023/01/a-familiar-stranger.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj6nCOaynaBKuvBFPZh-DSxQKfUQVIAUH8B6vVAh8Jm0C_hID-HL4gLh6rvEL_LU3Pf2GNiGnmnIVsFZtM9f82h2yDw_1wKRPxaPTYa7KoeL0Qpx8Mde5ooiIxXbaugpBtaDvmd8FYqD2Nc/w180-c-h250/?A Familiar Stranger / The Evil Face China Web Drama.jpg",
    "summary": "A little painter was fooled into changing faces with the prime minister's daughter and takes her place to marry a general.Shen Qin (Song Zhao Yi), the eldest daughter of the prime minister possesses an alluring beauty. Refusing to be used as her father's political tool, she escapes her own marriage by tricking a little painter named Shiqi (Ke Ying) into exchanging her face for a brand new identity. Shiqi wakes up and finds that she now has Shen Qin's face and that the person she must marry is none other than Xiao Hansheng (Cheng Lei), the man she fell in love with at first sight many years ago.With Shiqi's face, Shen Qin can now stay by the side of her beloved Ning Wang (Wang Zexuan). Through their daily interactions, Xiao Hansheng gradually discovers that the woman he married has many similarities with the woman he could not forget many years ago... Meanwhile, Shen Qin realizes that Ning Wang keeps going back to Shiqi. She can no longer tell if he's actually fallen in love with Shiqi who has her face or if he regrets abandoning Shen Qin."
  },
  {
    "title": "A Family Has Children In The First Place",
    "link": "http://www.chinesedrama.info/2018/06/drama-family-has-children-in-first-place.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgHclMpFrtR2f_gmUJfdn3qkb-33UNyrjrp3hPg9Iq9lnZXq2OJCrHY1lErITA7bMb5JdJRI9Axa81x7gvDkSLwqg0Zc0cHdyE-aDeyGhsUhlnZcyvyApW9aKsVcgOY3RQwjoF0Gx-Q1Nk/w180-c-h250/A+family+has+children+in+the+first+place+cf1b9d16fdfaaf5124861915805494eef01f7a37.jpg",
    "summary": "An upgraded version of the 2005 family sitcom Happy Home that revolves around two blended families trying to make things work as a household.The 25-year-old Jiang Nan (Zhang Yezi) and her 22-year-old brother Jiang Bei (Zhang Yishan) are all grown up, but have to face a situation where their parents have gotten a divorce and their apartment have been split in two. Jiang Nan and her mother Wu Qiong (Wang Lin) take the upper floor while Jiang Bei and his father Jiang Guoli (Zhou Xiaobin) live downstairs.Jiang Guoli who's already 50 years old remarries the 35-year-old gym instructor Dai Lingling (Song Ning). She has an eight-year-old son named Tong Tong (Peng Yibo). Wu Qiong who's 49 years old marries Du Wei (Gao Yalin), an actor who has been a longtime idol of hers. Du Wei has a 12-year-old daughter named Yang Yang (Guo Xinru). Just like that, the two pairs of parents and their four kids are living under one roof."
  },
  {
    "title": "A Fangirl's Romance",
    "link": "http://www.chinesedrama.info/2018/07/drama-fangirls-romance.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjjs4nXej0ZCB-_XqH-QKQ3-GZl-32IpTJOXU5OSQ93vkATaZq6nqwcQKDTsrkLmfJUAxsBUDJMT58ofAm5eaHQ0oBUQR8Yzek-ftabaLnzABtudrPEqnlbdzz5KoROy0qq3gESCH_WNGh8/w180-c-h250/5993.jpg",
    "summary": "A story that follows a millennial who starts on a magical journey to find his birth father.In order to stop his mother's absurd claims that singer Lo Ta-yu is his father, Gao Ge (Peter Sheng) accompanies his mother to Shenchuan to meet Lo Ta-yu himself, yet the two get separated along the way. Together with Dou Dou (Yu Xiaowei) and Yu Wei (Guo Shutong), Gao Ge runs into his mother's old friends from work and discovers her wild, colorful and romantic past."
  },
  {
    "title": "A Female Student Arrives at the Imperial College",
    "link": "http://www.chinesedrama.info/2020/09/drama-female-student-arrives-at.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjVOtuIvvTQ1avxzY5O_HQuLtGfhQfWfwCwny2TWt31a-hIUQvo7MZhVmV1GAaK387oiDKH_0oEAyX8vTTHKXTUhnx43AUjp6tRf4ZlJxO0z90DOg7-X9d4m0ZlodXqNE5zY2b74knTO0se/w180-c-h250/?A Female Student Arrives at the Imperial College China Web Drama.jpg",
    "summary": "Because of a bet to get the unapproachable Yan Yunzhi to accept her sachet, Sang Qi becomes the only female to enter an imperial college.Sang Qi (Zhao Lusi) agrees to a bet that she can get Yan Yunzhi (Xu Kaicheng), the number one young master of Great Yan, to accept her sachet and watch lanterns with her on Spring Festival. Thinking that it would be an easy task, she hits a wall after being rejected repeatedly by him.Upon learning that Yan Yunzhi teaches at the imperial college, she decides to study at the school. Her father, Grand Marshal Sang Gong, shamelessly cries and begs seven times for the emperor to allow his daughter to attend school. Just like that, Sang Qi gets in and becomes classmates with her childhood friend Zhou Wenyuan (Ren Hao). At the same time, a mysterious organization disrupts the peace in the capital. Sang Qi and Yan Yunzhi join hands to find the mastermind."
  },
  {
    "title": "A Fist Within Four Walls",
    "link": "http://www.chinesedrama.info/2016/07/drama-cheng-zhai-ying-xiong.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhgAGgwXCyh3m6pGBuKySUx40faHkcRNdYUzGpHdIyWOFbg4p56ns_r1D4ug3TwpPrHwAgs7rz5Jpok-BrfYeBTlBeQ2XTIVYk1mJ1XfEV7Wp6-xm0xqz5oift9dzMQ5PhUMVg8ZgNxmNc/w180-c-h250/3249.jpg",
    "summary": null
  },
  {
    "title": "A Forbidden Marriage",
    "link": "http://www.chinesedrama.info/2021/10/web-drama-forbidden-marriage.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjKP4tgpccKYWNGHnMxtqns5xopwiL0-BT4OqmBYaE7iYsCLpT01-a57jBT2oZoJS2cW5PHs7lcWR77sQdVpAzd3a4SIJy0xjxI5Orkjj69MOXbfe1_QW6xN2rUIJ8Sfjq8peSOFLl5xeoa/w180-c-h250?A Forbidden Marriage China Web Drama.jpg",
    "summary": "A woman from the demon sect is determined to realize her dream. They say that Shishu (Uncle-Master) from the righteous sect is a very good person, helpful and unorthodox. She wants to marry such a man."
  },
  {
    "title": "A Gallant Army",
    "link": "http://www.chinesedrama.info/2019/11/drama-gallant-army.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiuD4dbAxf15gm-u9cxSgkg3tOhzdMw0kXsgXZBWQHWMM6jZjwqRQ7F0mO5m-blR_6I1PqmLN4aHA4RlyroyD7dBL4XDkbgL6Y15xgd5hCZGto4V88-HKCJtjpSY3e4F0dQYNSNefjHsW8/w180-c-h250/?A Gallant Army China Drama.jpg",
    "summary": "Set in the stage of the Huaihai campaign, the story follows a soldier who leads his men to victory after making great sacrifices.In the year 1948, Mao Bao (Li Jian), a field army officer, reunites with his old friend Lu Shengwen (Zhang Zijun) in a battle where they are fighting on opposite sides. Lu Shengwen escapes during a crossfire. Not wanting to let his military abilities go to waste, Mao Bao is given a second chance to make up for his mistake as he heads up the vanguard known as the 'tiger team'. Mao Bao and Lu Shengwen meet in battle again with Mao Bao fighting for Communist Party of China and Lu Shengwen fighting for the Kuomintang."
  },
  {
    "title": "A Generation of Craftsmen",
    "link": "http://www.chinesedrama.info/2023/05/a-generation-of-craftsmen.html",
    "poster": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO3lfBX01__EqdwItdAgCOErU9T21gNr8WpWyQkbeN4BCRyNEfT9QRVlNNTJpSDVmHTBA-71c_EY0cgXXU26QIlH2oGu70cdsqN_vOXPBi3r8uADwl-8PlhlmVQ-2c3wiMpFJW4e8tdXht/w180-c-h250?A Generation of Craftsmen China Drama.jpg",
    "summary": "It tells the story of a Putian wood sculptor clan known throughout the industry for their superb skills. Due to a conspiracy, they experience ups and downs along with the changing times."
  }
]